fullstack-web/blogBack/app/controllers/api/v1/categories_controller.rb

      def index
        categories = Category.order('created_at DESC');
---
SELECT `categories`.* FROM `categories` ORDER BY created_at DESC

      def create
        @category = Category.new(category_params)
        if @category.save
---
INSERT INTO `categories` (`name`, `description`, `created_at`, `updated_at`) VALUES ('c', 'c', '2021-03-09 15:24:44.538661', '2021-03-09 15:24:44.538661')

      def update
        if @category.update(category_params)
---
UPDATE `categories` SET `categories`.`description` = 'uma descricao da categoria', `categories`.`updated_at` = '2021-03-09 16:06:56.580921' WHERE `categories`.`id` = 47