fullstack-web/blogBack/app/controllers/api/v1/posts_controller.rb

SELECT `posts`.* FROM `posts` ORDER BY created_at DESC
---
      def index
        posts = Post.order('created_at DESC');

INSERT INTO `posts` (`title`, `text`, `created_at`, `updated_at`, `category_id`) VALUES ('aqui dddd', 'oi teste', '2021-03-09 17:09:04.778707', '2021-03-09 17:09:04.778707', 47)
---
      def create
        @post = Post.new(post_params)
        if @post.save

UPDATE `posts` SET `posts`.`title` = 'um post 2', `posts`.`text` = 'um texto 2', `posts`.`updated_at` = '2021-03-09 18:08:19.856569' WHERE `posts`.`id` = 47
---
      def update
        if @post.update(post_params)

SELECT `posts`.* FROM `posts` WHERE `posts`.`category_id` = 5
---
      def recoverPostsByCategory
        posts = Post.where(category_id: params[:category_id])

SELECT `posts`.* FROM `posts` WHERE (posts.created_at >= 2021-03-08T00:00:00+00:00) AND (posts.created_at < 2021-03-09T00:00:00+00:00)
---
      def recoverPostsByDate
        date = DateTime.parse(params[:date])
        posts = Post.where(created_at: date..date+24.hours)